/* Опис ДЗ: Перевірка теорії ймовірності. Напишіть функцію яка буде генерувати певну кількість випадкових чисел в діапазоні від 100 до 1000 включно. Порахувати кількість парних та непарних серед них. Обчислити відсоткове співвідношення - чи буде воно близьке до 50%50? Приклад функції checkProbabilityTheory(count). Парметр count буде вказувати скільки разів буде генеруватися випадкове число.

Умови виконання ДЗ

    Функція виводить інформацію
    Кількість згенерованих чисел: кількість чисел
    Парних чисел: кількість парних чисел
    Не парних чисел: кількість не парних чисел
    Відсоток парних до не парних:
    Не використовувати функції або інші матеріали які ми не вивчали
    Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки

Будь ласка, надайте наступні дані для перевірки вашої роботи:

    Створіть гілку js_homework4.
    Додати туди ваше домашне завдання
    Вислати вашу гілку */




function checkProbability(count) {
    let evenNumbers = 0, oddNumbers = 0;
    for (let i = 1; i <= count; i++) {
      let randomNumber = Math.floor(((Math.random() * 901) + 100));
        if (randomNumber % 2 === 0) {
            evenNumbers++
        } else {
            oddNumbers++
        }
        
    }
    let sumEvenPlusOdd = evenNumbers + oddNumbers
    console.log("Кількість згенерованих чисел: " + sumEvenPlusOdd);
    console.log("Парних чисел: " + evenNumbers)
    console.log("Непарних чисел: " + oddNumbers)
    console.log(("Відсоток парних до непарних: " + ((evenNumbers / sumEvenPlusOdd)*100).toFixed(0)) 
                                                 + " / " 
                                                 + (((oddNumbers / sumEvenPlusOdd)*100).toFixed(0)))
    
}

checkProbability (1000)